back_end/app/controllers/todos_controller.rb

  def index
    todos = Todo.all.map { |todo| {id: todo.id, content: todo.content} }
---
SELECT "todos".* FROM "todos"